
&НаСервере
Функция ПолучитьЦенуБилета(Ссылка)
	Возврат Ссылка.Цена;
КонецФункции

&НаКлиенте
Процедура РассчитатьСуммуБилета()
	ТекСтрока = Элементы.ПродажаБилета.ТекущиеДанные;
	ТекСтрока.Сумма = ТекСтрока.ЦенаБилета * ТекСтрока.Количество; 
КонецПроцедуры

&НаКлиенте
Процедура ПродажаБилетаТипБилетаПриИзменении(Элемент)
	ТекСтрока = Элементы.ПродажаБилета.ТекущиеДанные;
	ЦенаБилета = ПолучитьЦенуБилета(ТекСтрока.ТипБилета);
	ТекСтрока.ЦенаБилета = ЦенаБилета;
	РассчитатьСуммуБилета();
КонецПроцедуры

&НаКлиенте
Процедура ПродажаБилетаКоличествоПриИзменении(Элемент)
	 РассчитатьСуммуБилета();
КонецПроцедуры






 

