
&НаСервере
Функция ПолучитьЦенуБилета(Ссылка)
	Возврат Ссылка.Цена;
КонецФункции

&НаКлиенте
Процедура РассчитатьСуммуБилета()
	ТекСтрока = Элементы.ПродажаБилета.ТекущиеДанные;
	ТекСтрока.Сумма = ТекСтрока.ЦенаБилета * ТекСтрока.Количество; 
КонецПроцедуры

&НаКлиенте
Процедура ПродажаБилетаТипБилетаПриИзменении(Элемент)
	ТекСтрока = Элементы.ПродажаБилета.ТекущиеДанные;
	ЦенаБилета = ПолучитьЦенуБилета(ТекСтрока.ТипБилета);
	ТекСтрока.ЦенаБилета = ЦенаБилета;
	РассчитатьСуммуБилета();
КонецПроцедуры

&НаКлиенте
Процедура ПродажаБилетаКоличествоПриИзменении(Элемент)
	 РассчитатьСуммуБилета();
КонецПроцедуры

&НаСервере
Процедура ЗаказПриИзмененииНаСервере()
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Заказ.ДатаПосещения КАК ДатаПосещения,
		|	ЗаказПродажаБилета.ТипБилета КАК ТипБилета,
		|	ЗаказПродажаБилета.ЦенаБилета КАК ЦенаБилета,
		|	ЗаказПродажаБилета.Количество КАК Количество,
		|	ЗаказПродажаБилета.Сумма КАК Сумма
		|ИЗ
		|	Документ.Заказ.ПродажаБилета КАК ЗаказПродажаБилета
		|		ПОЛНОЕ СОЕДИНЕНИЕ Документ.Заказ КАК Заказ
		|		ПО ЗаказПродажаБилета.Ссылка = Заказ.Ссылка
		|ГДЕ
		|	Заказ.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Заказ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Объект.ПродажаБилета.Очистить();
	
	Пока Выборка.Следующий() Цикл
	Объект.ДатаПосещения = Выборка.ДатаПосещения;	
	НоваяСтрока = Объект.ПродажаБилета.Добавить();
	НоваяСтрока.ТипБилета = Выборка.ТипБилета;
	НоваяСтрока.ЦенаБилета = Выборка.ЦенаБилета;
	НоваяСтрока.Количество = Выборка.Количество;
	НоваяСтрока.Сумма = Выборка.Сумма;
		
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаказПриИзменении(Элемент)
	ЗаказПриИзмененииНаСервере();
КонецПроцедуры






 

