
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Заказ") Тогда
		// Заполнение шапки
		ДатаПосещения = ДанныеЗаполнения.ДатаПосещения;
		Заказ = ДанныеЗаполнения.Ссылка;
		Для Каждого ТекСтрокаПродажаБилета Из ДанныеЗаполнения.ПродажаБилета Цикл
			НоваяСтрока = ПродажаБилета.Добавить();
			НоваяСтрока.Количество = ТекСтрокаПродажаБилета.Количество;
			НоваяСтрока.Сумма = ТекСтрокаПродажаБилета.Сумма;
			НоваяСтрока.ТипБилета = ТекСтрокаПродажаБилета.ТипБилета;
			НоваяСтрока.ЦенаБилета = ТекСтрокаПродажаБилета.ЦенаБилета;
		КонецЦикла;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры
